Repository: robot-xliff-farmer/bem-method
Catalog: bem-method.tmx
Source language: ru
Languages: en

source: Миграция
en: Migration

source: В блоках input, select и textarea модификатор width вынесен из темы islands. Это дает возможность использовать его без указания темы. Теперь при динамической генерации BEMJSON нужно добавить модификатор в зависимости:
en: The width modifier has been moved out of islands theme in input, select and textarea blocks. Now you do not need to specify the theme. But you need to add the modifier to dependencies when dynamically generating BEMJSON:

source: Контрибьюторам
en: Contributors

source: Список контрибьютеров данного проекта доступен по ссылке https://github.com/bem/bem-components/graphs/contributors. Вы так же можете получить его с помощью команды git log --pretty=format:"%an <%ae>" | sort -u.
en: The list of contributors is available at https://github.com/bem/bem-components/graphs/contributors. You may also get it with git log --pretty=format:"%an <%ae>" | sort -u.

source: История изменений
en: Changelog

source: В релиз вошли следующие исправления ошибок
en: Bug fixes

source: В select исправлена деградация поддержки уравления с клавиатуры (#1456).
en: Fixed errors in degradation of the keyboard control in select block (#1456).

source: Также в релиз вошли следующие изменения
en: Other changes

source: Теперь полю val в блоке progressbar по умолчанию присваивается ноль (#1468).
en: Now the val field in the progressbar block has a zero value by default (#1468).

source: Добавлено описание button_view_plain в документацию (#1454).
en: The button_view_plain block is described in the documentation (#1454).

source: Крупные изменения
en: Major changes

source: Реализована опциональная поддержка Internet Explorer 8 с деградацией (#1205). Инструкцию по использованию см. в README.
en: Optional support for Internet Explorer 8 in graceful degradation way was implemented (#1205). For more info please refernotes in README.

source: Библиотека bem-core была обновлена до версии 2.6.0.
en: bem-core dependency was updated to 2.6.0.

source: Исправлена ошибка при изменении размеров textarea (#1330).
en: An issue with resize in textarea block was fixed (#1330).

source: Исправлена ошибка, при которой в момент раскрытия select мог вызвать появление полос прокрутки на странице (#1323).
en: An issue with select transition which led to scrollbars flash was fixed (#1323).

source: Убрана подсветка контролов при тапе на тач-устройствах (#1390).
en: Controls highlight on touch devices was removed (#1390).

source: Исправлен внешний вид button_view_plain в состоянии disabled (#1378).
en: Appearance of button_view_plain in disabled state was fixed (#1378).

source: Исправлена ошибка в блоке input, возникавшая в Chrome, если текст не помещался в поле (#1382).
en: An issue with input block behaviour in Chrome was fixed (#1382).

source: Исправлена ошибка, при которой могло быть видно содержимое закрытого блока modal (#1372).
en: An issue with visible content of hidden modal was fixed (#1372).

source: Исправлена ошибка лишней подписки на keydown в блоке menu (#1381).
en: An issue with extra bounding to keydown handler in menu block was fixed (#1381).

source: Событие при нажатии на escape в блоке select теперь не всплывает (#1367).
en: Event propagation in select block when escape is pressed is now stopped (#1367).

source: Блок link внутри menu-item_type_link в состоянии disabled тоже получает состояние disabled автоматически (#1353).
en: link inside disabled menu-item_type_link is now disabled as well (#1353).

source: Добавлена возможность использовать модификатор _width_available без указания темы (#1404).
en: Ability to use modifier _width_available without theme was added (#1404).

source: Улучшен конфиг сборки поставки bem-components как библиотеки (dist) (#1411).
en: Config to build bem-components library distribution was improved (dist) (#1411).

source: menu теперь генерирует исключения с подробным описанием, если используется с несоответствующим содержимым (#1320).
en: menu block will throw descriptive error in case of wrong content provided (#1320).

source: Обновлена документация.
en: Documentation is up-to-date.

source: Подключить библиотеку в проект можно любым известным вам способом. Например, с помощью bem-tools или ENB. Сделать это можно в конфигурационном файле выбранного вами сборщика.
en: You can use any way you are familiar with to include the library into your project. For example, you can use bem-tools or ENB. To connect the library to your project use the configuration file of the selected building tool.

source: Если вы используете project-stub как основу проекта, то подключать библиотеку не нужно. Она подключена в проект по умолчанию.
en: If you use project-stub to start your project, you do not need to connect the library – it is connected by default.

source: Для поддержки данного браузера необходимо подключить на страницу es5-shim и дополнительные файлы стилей с расширением *.ie.styl. Для этого следует добавить их в сборку (например, так) и в блоке page добавить условные комментарии как показано ниже:
en: To support IE8, you must connect es5-shim and additional styles with the *.ie.styl extension to the page. Add the styles to the build (i.e., like this) and add the conditional comments to the page block, as shown below:

source: Разработка библиотеки ведется на GitHub. Все задачи, планы по разработке и сроки доступны там же. Любой разработчик может принять участие в работе над библиотекой: создать задачу с пожеланиями для команды разработчиков или прислать pull request с правками или собственным кодом.
en: GitHub is a platform for bem-components library development. We set all tasks, development raodmap and milestones using GitHub. Any developer could participate in the project: everyone could create an issue with some problems description or send a pull request with some code improvements.

source: Создать issue с описанием сути изменений.
en: Create an issue with a proper description.

source: Любым способом связать pull request и issue (например, c помощью комментария).
en: Link your pull request with an issue number any way you like. For example, leave a comment with the issue number.

source: Все тесты автоматически запускаются на Travis для каждого pull request'а.
en: All tests will be run automatically using Travis on each pull request.

source: Для тестирования верстки мы используем Gemini.
en: We use Gemini for layout testing.

source: Тесты каждого блока находятся в отдельном файле вида block-name.gemini.js в директории gemini/. Локально тесты запускаются руками, тесты на Travis запускаются автоматически. В качестве Selenium Grid мы используем сервис SauceLabs.
en: Tests for each block are stored in a separate fileblock-name.gemini.js in a directory gemini/. All tests could be executed manually or automatically using Travis. We use SauceLabs service as a Selenium Grid.

source: Для запуска тестов локально вам понадобится OpenSauce аккаунт в SauceLabs и утилита Sauce Connect. Разработчики команды БЭМ могут использовать аккаунт bem-components (мы не публикуем логин и пароль, потому что на аккаунте лимит на 3 одновременно запущенных браузера; будет эффективнее использовать разные аккаунты для ручного запуска тестов, тем более что они бесплатные).
en: You will need OpenSauce, a SauceLab account and SauceConnect utility to run the tests locally. Developers of BEM team could use bem-components account (we do not publish login and password because of the limit for three concurrent browsers launch; it is much more efficiently to use different free accounts for manual testing).

source: Установить и запустить Selenium Server или PhantomJS.
en: Install and run Selenium Server or PhantomJS.

source: Более подробно про запуск Gemini с разными бекендами читайте в статье Введение в работу с Gemini.
en: Read the Introducing Gemini article for more details on how Gemini works with different types of backends.

source: Сожмите изображения утилитой ImageOptim (это самый эффективный инструмент сжатия изображений на май 2014 года).
en: Compress them using the ImageOptimutility (this is the most effective tool for images compression for May 2014).

source: Все тесты автоматически запускаются на Travis для каждого pull request'a.
en: All tests will be run automatically using Travis on each pull request.

source: Используется для создания текстовой области.
en: Use this block for creating a text area that allows to enter multiple lines of a text.

source: Обзор блока
en: Overview

source: Модификаторы блока
en: Modifiers of the block

source: Модификатор
en: Modifier

source: Допустимые значения
en: Acceptable values

source: Способы использования
en: Use cases

source: Описание
en: Description

source: Максимально допустимая ширина текстовой области.
en: The maximum allowed width of the text area.

source: Неактивное состояние.
en: The disabled state.

source: Фокус на блоке.
en: The block is in focus.

source: Стилевое оформление.
en: A custom design.

source: Размер текстовой области. Используется только для текстовых областей с модификатором theme в значении islands.
en: The size of the text area. Use sizes only for text areas when the theme modifier is set to islands.

source: Специализированные поля блока
en: Custom fields of the block

source: Поле
en: Field

source: Тип
en: Type

source: Имя текстовой области.
en: The name of the text area.

source: Содержимое текстовой области.
en: The contents of the text area.

source: Подсказка в текстовой области.
en: The hint of the text area.

source: Уникальный идентификатор текстовой области.
en: The unique ID of the text area.

source: Последовательность перехода между контролами при нажатии на Tab.
en: The order when navigating through controls on a page by pressing the Tab key.

source: Описание блока
en: Block description

source: Блок textarea используется для создания области, в которую можно вводить несколько строк текста.
en: Use the textarea block to create the text area that allows to enter multiple lines of the text..

source: Модификатор width
en: width modifier

source: Допустимое значение: 'available'.
en: Acceptable value: 'available'.

source: Способы использования: BEMJSON.
en: Use cases: BEMJSON.

source: Позволяет растягивать текстовую область на максимально допустимую ширину.
en: Use to set the maximum available width of the text area.

source: { block : 'textarea', mods : { theme : 'islands', size : 'm', width : 'available' }, placeholder : 'Ваш текст должен быть здесь' }
en: { block : 'textarea', mods : { theme : 'islands', size : 'm', width : 'available' }, placeholder : 'Your text should be here' }

source: Модификатор disabled
en: disabled modifier

source: Допустимое значение: true.
en: Acceptable value: true.

source: Способы использования: BEMJSON, JS.
en: Use case: BEMJSON, JS.

source: Отвечает за неактивное состояние, при котором блок виден, но недоступен для действий пользователя.
en: The modifier makes the block inactive. The disabled block is visible but not available for user actions.

source: js { block : 'textarea', mods : { theme : 'islands', size : 'm', disabled : true }, placeholder : 'Ваш текст должен быть здесь' }
en: js { block : 'textarea', mods : { theme : 'islands', size : 'm', disabled : true }, placeholder : 'Your text should be here' }

source: Модификатор focused
en: focused modifier

source: Допустимое значение:true.
en: Acceptable value:true.

source: Выставляется автоматически при получении блоком фокуса.
en: The modifier puts the focus on the block.

source: Отвечает за наличие фокуса на блоке.
en: The modifier puts the focus on the block.

source: { block : 'textarea', mods : { theme : 'islands', size : 'm', focused : true }, placeholder : 'Ваш текст должен быть здесь' }
en: { block : 'textarea', mods : { theme : 'islands', size : 'm', focused : true }, placeholder : 'Your text should be here' }

source: Модификатор theme
en: theme modifier

source: Допустимое значение:'islands'.
en: Acceptable value:'islands'.

source: Отвечает за стилевое оформление блока.
en: The modifier gives the block a custom design.

source: Необходимо использовать с модификатором size.
en: The islands theme requires the size modifier.

source: { block : 'textarea', mods : { theme : 'islands', size: 'm' }, placeholder : 'Ваш текст должен быть здесь' }
en: { block : 'textarea', mods : { theme : 'islands', size: 'm' }, placeholder : 'Your text should be here' }

source: Модификатор size
en: size modifier

source: Допустимые значения для темы islands: 's', 'm', 'l', 'xl'.
en: Acceptable values for the islands: 's', 'm', 'l', 'xl'.

source: Необходимо использовать с модификатором theme в значении islands.
en: Use the theme modifier only for blocks with the islands theme.

source: { block : 'textarea', mods : { theme : 'islands', size: 's' }, placeholder : 'Размер s' }
en: { block : 'textarea', mods : { theme : 'islands', size: 's' }, placeholder : 'Size s' }

source: { block : 'textarea', mods : { theme : 'islands', size: 'm' }, placeholder : 'Размер m' }
en: { block : 'textarea', mods : { theme : 'islands', size: 'm' }, placeholder : 'Size m' }

source: { block : 'textarea', mods : { theme : 'islands', size: 'l' }, placeholder : 'Размер l' }
en: { block : 'textarea', mods : { theme : 'islands', size: 'l' }, placeholder : 'Size l' }

source: { block : 'textarea', mods : { theme : 'islands', size: 'xl' }, placeholder : 'Размер xl' }
en: { block : 'textarea', mods : { theme : 'islands', size: 'xl' }, placeholder : 'Size xl' }

source: Поле name
en: name field

source: Тип: String.
en: Type: String.

source: Определяет уникальное имя блока.
en: Specifies the block unique name.

source: { block : 'textarea', mods : { theme : 'islands', size: 'm' }, name : 'Обратная связь' }
en: { block : 'textarea', mods : { theme : 'islands', size: 'm' }, name : 'Feedback' }

source: Поле val
en: val field

source: Определяет содержимое текстовой области.
en: Specifies the content of the text area.

source: { block : 'textarea', mods : { theme : 'islands', size: 'm' }, name : 'Feedback', val : 'Этот текст можно и нужно заменить' }
en: { block : 'textarea', mods : { theme : 'islands', size: 'm' }, name : 'Feedback', val : 'The text should be changed if necessary' }

source: Поле placeholder
en: placeholder field

source: Определяет текст подсказки.
en: Specifies the hint in the text area.

source: { block : 'textarea', mods : { theme : 'islands', size : 'm' }, placeholder : 'Ваш текст должен быть здесь' }
en: { block : 'textarea', mods : { theme : 'islands', size : 'm' }, placeholder : 'Your text should be here' }

source: Поле id
en: id field

source: Определяет уникальный идентификатор текстовой области.
en: Specifies the text area unique ID.

source: { block : 'textarea', mods : { theme : 'islands', size : 'm' }, placeholder : 'Ваш текст должен быть здесь', id : 'Unique_1' }
en: { block : 'textarea', mods : { theme : 'islands', size : 'm' }, placeholder : 'Your text should be here', id : 'Unique_1' }

source: Поле tabIndex
en: tabIndex field

source: Тип: Number.
en: Type: Number.

source: Определяет последовательность перехода между контролами при нажатии на Tab.
en: Specifies the tab order when pressing Tab to navigate between controls on a page.

source: { block : 'textarea', mods : { theme : 'islands', size : 'm' }, placeholder : 'Ваш текст должен быть здесь', tabIndex : 1 }
en: { block : 'textarea', mods : { theme : 'islands', size : 'm' }, placeholder : 'Your text should be here', tabIndex : 1 }

source: Используется для выбора файла, предназначенного для отправки на сервер.
en: Use this block to upload a file for sending to a server.

source: Размер блока.
en: The size of the block.

source: Уникальное имя блока.
en: The unique block name.

source: Содержимое кнопки для выбора файла.
en: Specifies the button content:

source: Текст сообщения, когда файл не выбран.
en: Specifies the text message when the file is not selected.

source: По умолчанию блок attach визуально представлен:
en: By default the attach block is visually represented by:

source: кнопкой (button), вызывающей системное окно загрузки файла;
en: the (button) that opens the system window to upload a file.

source: текстовым сообщением.
en: The text message.

source: После выбора файла отображаются:
en: The following elements became available when upload of the file is finished:

source: имя файла (элемент text);
en: The file name (the text element).

source: крестик для отмены выбора (элемент clear).
en: The element for file deletion (the clear element).

source: Реализация блока не позволяет:
en: The block functionality does not support:

source: прикреплять несколько файлов;
en: More than one file attaching.

source: перетаскивать элементы (drag-and-drop).
en: Drag-and-drop.

source: { block : 'attach', mods : { theme : 'islands', size : 'm', disabled : true }, button : 'Выберите файл', noFileText : 'Файл не выбран' }
en: { block : 'attach', mods : { theme : 'islands', size : 'm', disabled : true }, button : 'Select file, noFileText : 'No file selected' }

source: Выставляется автоматически при получении блока фокуса.
en: It is set automatically when a block receives the focus.

source: { block : 'attach', mods : { theme : 'islands', size : 'm', focused : true }, button : 'Выберите файл', noFileText : 'Файл не выбран' }
en: { block : 'attach', mods : { theme : 'islands', size : 'm', focused : true }, button : 'Select file', noFileText : 'No file selected' }

source: Допустимое значение: 'islands'.
en: Acceptable value: 'islands'.

source: Способ использования: BEMJSON.
en: Use case: BEMJSON.

source: { block : 'attach', mods : { theme : 'islands', size : 'm' }, button : 'Выберите файл', noFileText : 'Файл не выбран' }
en: { block : 'attach', mods : { theme : 'islands', size : 'm' }, button : 'Select file', noFileText : 'No file selected' }

source: Допустимое значение: 's', 'm', 'l', 'xl'.
en: Acceptable values: 's', 'm', 'l', 'xl'.

source: Задает размер блоку.
en: Sets the size value for the block.

source: Необходимо использовать с модификатором theme.
en: Requires the theme modifier.

source: { block : 'attach', mods : { theme : 'islands', size : 's' }, button : 'Выберите файл', noFileText : 'Файл не выбран' }
en: { block : 'attach', mods : { theme : 'islands', size : 's' }, button : 'Select file', noFileText : 'File not selected' }

source: { block : 'attach', mods : { theme : 'islands', size : 'l' }, button : 'Выберите файл', noFileText : 'Файл не выбран' }
en: { block : 'attach', mods : { theme : 'islands', size : 'l' }, button : 'Select file', noFileText : 'No file selected' }

source: { block : 'attach', mods : { theme : 'islands', size : 'xl' }, button : 'Выберите файл', noFileText : 'Файл не выбран' }
en: { block : 'attach', mods : { theme : 'islands', size : 'xl' }, button : 'Select file', noFileText : 'No file selected' }

source: { block : 'attach', mods : { theme : 'islands', size : 'm' }, name : 'attach-logo', button : 'Выберите файл' }
en: { block : 'attach', mods : { theme : 'islands', size : 'm' }, name : 'attach-logo', button : 'Select file' }

source: Поле button
en: Fieldbutton

source: Тип: String, BEMJSON.
en: Type: String, BEMJSON.

source: Определяет содержимое кнопки для выбора файла:
en: Specifies the button content:

source: задает текст кнопки (String)
en: The text (String)

source: { block : 'attach', mods : { theme : 'islands', size : 'm' }, button : 'Выберите файл' }
en: { block : 'attach', mods : { theme : 'islands', size : 'm' }, button : 'Select file' }

source: задает внешний вид и тип кнопки (BEMJSON)
en: The type and appearance (BEMJSON)

source: { block : 'attach', mods : { theme : 'islands', size : 'm' }, button : { block : 'button', icon : { block : 'icon', mods : { action : 'download' } }, text: 'Выберите файл' } }
en: { block : 'attach', mods : { theme : 'islands', size : 'm' }, button : { block : 'button', icon : { block : 'icon', mods : { action : 'download' } }, text: 'Select file' } }

source: Поле noFileText
en: FieldnoFileText

source: Определяет текст сообщения, когда файл не выбран.
en: Specifies the text message when the file is not selected.

source: Используется в качестве вспомогательного декоративного изображения в других блоках.
en: Use this block for creating an auxiliary graphical element in other blocks.

source: Адрес иконки.
en: The address of the icon.

source: Контент изображения в формате SVG.
en: Image content in SVG format.

source: Используется в качестве вспомогательного декоративного изображения в других блоках. Адаптирован для выравнивания по базовой линии строки.
en: Use the icon block to create the auxiliary graphical element in other blocks. The block is adapted to align with the baseline.

source: Для создания самостоятельного изображения используйте блок image.
en: To create an independent image, use the image block.

source: Пример добавления иконки с помощью модификатора. Для реализации используется служебный уровень test.blocks библиотеки bem-components.
en: The block could be declared through specific modifiers. For the examples below we implement modifiers on the service level called test.blocks of bem-components library.

source: Поле url
en: url field

source: Определяет адрес иконки.
en: Specifies the address of the icon.

source: Поле content
en: content field

source: Тип: BEMJSON, String.
en: Type: BEMJSON, String.

source: Определяет контент изображения в формате SVG.
en: Specifies content of the image in SVG format.

source: Используется для отображения группы однотипных переключателей, реализованных блоком radio.
en: Use this block for creating a group of related radio switches (based on the radio block).

source: Тип группы радиопереключателей.
en: The type of the radio switches group.

source: Размер радиопереключателей в группе. Используется только для радиопереключателей с модификатором theme в значении islands.
en: he size of the radio switches group. Use sizes only for radio switches group when the theme modifier is set to islands.

source: Значение выбранного радиопереключателя.
en: A set of values of the selected radio switches.

source: Набор значений для каждого радиопереключателя группы. Каждому типу радиопереключателя соответствует разный набор значений.
en: A set of values for each radio switch type in the group. Each radio switch has its own set of values.

source: Блок radio-group позволяет управлять внешним видом и состоянием вложенных радиопереключателей и выбирать только один пункт из предопределенного списка.
en: Use the radio-group block to control the size, state, and appearance of the radio switches in the group. The block allows to choose the only one radio switch from the group.

source: Модификатор type
en: type modifier

source: Допустимые значения: 'button', 'line'.
en: Acceptable values: 'button', 'line'.

source: Кнопочный радиопереключатель (модификатор type в значении button)
en: Button-based radio-group (typemodifier with button value)

source: Позволяет реализовать блок radio-group с помощью радиопереключателей с типом button. Все радиопереключатели группы в данном случае всегда располагаются в линию.
en: Implements the radio-group block using the button. Grouped button-based radio switches are always aligned in a line.

source: { block : 'radio-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'radio-button', options : [ { val : 1, text : 'Футбол' }, { val : 2, text : 'Баскетбол' }, { val : 3, text : 'Гандбол' } ] }
en: { block : 'radio-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'radio-button', options : [ { val : 1, text : 'Football' }, { val : 2, text : 'Basketball' }, { val : 3, text : 'Handball' } ] }

source: Выравнивание (модификатор type в значении line)
en: Выравнивание (type modifier with line value)
